tutorials/rigidBodyAndBeam_beamFoamCoupled_nOuter8/0/beam/DW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "2";
    object      DW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
60
(
(-4.0292e-17 -6.68267e-28 -2.13168e-12)
(-1.38388e-16 -2.03975e-27 -6.38923e-12)
(-2.1435e-16 -3.38417e-27 -1.06293e-11)
(-2.91851e-16 -4.7373e-27 -1.48404e-11)
(-3.64802e-16 -6.06682e-27 -1.9011e-11)
(-4.38579e-16 -7.39033e-27 -2.31296e-11)
(-5.10728e-16 -8.69016e-27 -2.71852e-11)
(-5.63545e-16 -9.97293e-27 -3.11664e-11)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    right
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
